using Newtonsoft.Json;

using System.Runtime.Serialization;

namespace ShareInvest.OpenAPI.Entity;

/// <summary>시세표성정보요청</summary>
public class Opt10007 : TR
{
    /// <summary>시세표성정보</summary>
    [DataMember, JsonProperty("시세표성정보")]
    public MultiOpt10007[]? MultiResponse
    {
        get; set;
    }
    /// <summary>
    /// 1.종목코드
    /// </summary>
    public override string[] Id => new[] { "종목코드" };
    public override string[]? Value
    {
        get; set;
    }
    public override string? RQName
    {
        set
        {

        }
        get => "시세표성정보요청";
    }
    public override string TrCode
    {
        get => nameof(Opt10007);
    }
    public override int PrevNext
    {
        get; set;
    }
    public override string ScreenNo
    {
        get => LookupScreenNo;
    }
    public override string[] Single => Array.Empty<string>();
    public override string[] Multiple => new[] { "종목명", "종목코드", "날짜", "시간", "전일종가", "전일거래량", "상한가", "하한가", "전일거래대금", "상장주식수", "현재가", "부호", "등락률", "전일비", "시가", "고가", "저가", "체결량", "거래량", "거래대금", "예상체결가", "예상체결량", "예상매도우선호가", "예상매수우선호가", "거래시작일", "행사가격", "최고가", "최저가", "최고가일", "최저가일", "매도1호가", "매도2호가", "매도3호가", "매도4호가", "매도5호가", "매도6호가", "매도7호가", "매도8호가", "매도9호가", "매도10호가", "매수1호가", "매수2호가", "매수3호가", "매수4호가", "매수5호가", "매수6호가", "매수7호가", "매수8호가", "매수9호가", "매수10호가", "매도1호가잔량", "매도2호가잔량", "매도3호가잔량", "매도4호가잔량", "매도5호가잔량", "매도6호가잔량", "매도7호가잔량", "매도8호가잔량", "매도9호가잔량", "매도10호가잔량", "매수1호가잔량", "매수2호가잔량", "매수3호가잔량", "매수4호가잔량", "매수5호가잔량", "매수6호가잔량", "매수7호가잔량", "매수8호가잔량", "매수9호가잔량", "매수10호가잔량", "매도1호가직전대비", "매도2호가직전대비", "매도3호가직전대비", "매도4호가직전대비", "매도5호가직전대비", "매도6호가직전대비", "매도7호가직전대비", "매도8호가직전대비", "매도9호가직전대비", "매도10호가직전대비", "매수1호가직전대비", "매수2호가직전대비", "매수3호가직전대비", "매수4호가직전대비", "매수5호가직전대비", "매수6호가직전대비", "매수7호가직전대비", "매수8호가직전대비", "매수9호가직전대비", "매수10호가직전대비", "매도1호가건수", "매도2호가건수", "매도3호가건수", "매도4호가건수", "매도5호가건수", "매수1호가건수", "매수2호가건수", "매수3호가건수", "매수4호가건수", "매수5호가건수", "LP매도1호가잔량", "LP매도2호가잔량", "LP매도3호가잔량", "LP매도4호가잔량", "LP매도5호가잔량", "LP매도6호가잔량", "LP매도7호가잔량", "LP매도8호가잔량", "LP매도9호가잔량", "LP매도10호가잔량", "LP매수1호가잔량", "LP매수2호가잔량", "LP매수3호가잔량", "LP매수4호가잔량", "LP매수5호가잔량", "LP매수6호가잔량", "LP매수7호가잔량", "LP매수8호가잔량", "LP매수9호가잔량", "LP매수10호가잔량", "총매수잔량", "총매도잔량", "총매수건수", "총매도건수" };
}